#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/perfolio/web/runs/run-bs5D4gKcCBeC53Ac

Waiting for the plan to start...

Terraform v0.14.3
Configuring remote state backend...
Initializing Terraform configuration...
nomad_job.website: Refreshing state... [id=website]
nomad_job.app: Refreshing state... [id=app]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # nomad_job.app will be updated in-place
  ~ resource "nomad_job" "app" {
      ~ allocation_ids          = [
          - "1a9c895c-3142-2398-ff8c-12e035b70204",
          - "cf9df8c7-e2ed-3376-301f-62358e81832e",
          - "2c9d890d-0c4a-e881-b781-df0b599fe4f1",
          - "34d15545-4851-608b-9627-f7a3e9bc4ab9",
          - "dd869cde-d61a-c926-0d7f-64b59e158ae5",
          - "022a2d16-7573-42e8-3d34-6474eab30678",
          - "ed920879-a9c8-826a-8f13-ddf82e4f774b",
          - "073eb6d0-ad25-194a-b0b2-e8ad06427627",
          - "2baf811b-4a57-4be2-687b-afcfc2947b41",
        ] -> (known after apply)
        id                      = "app"
      ~ jobspec                 = <<-EOT
            job "app" {
              datacenters = ["dc1"]
              type        = "service"
            
              update {
                max_parallel      = 1
                min_healthy_time  = "10s"
                healthy_deadline  = "3m"
                progress_deadline = "10m"
                auto_revert       = true
                canary            = 0
              }
            
              group "app" {
          -     count = 1
          +     count = 3
            
                network {
                  port "http" {
                    to = 3000
                  }
                }
            
                restart {
                  attempts = 2
                  interval = "30m"
                  delay    = "15s"
                  mode     = "fail"
                }
            
                task "app" {
                  driver = "docker"
            
                  template {
                    source      = "/home/terraform/deploy/.env"
                    destination = "${NOMAD_SECRETS_DIR}/.env"
                    env         = true
                    change_mode = "restart"
                  }
            
                  config {
                    image = "perfolio/web-app"
                    ports = ["http"]
          -          labels {
          -           "traefik.enable" = "true",
          -           "traefik.http.routers.app.rule" = "Host(`app.perfol.io`)",
          + 
          +         labels {
          +           "traefik.enable"                = "true"
          +           "traefik.http.routers.app.rule" = "Host(`app.perfol.io`)"
                    }
                  }
            
                  service {
                    name = "app"
          - 
          +         port = "http"
          +  tags = [
          +           "traefik.enable=true",
          +           "traefik.http.routers.app.rule=Host(`app.perfol.io`)",
          +         ]
          +         check {
          +           type     = "http"
          +           port     = "http"
          +           path     = "/"
          +           interval = "2s"
          +           timeout  = "2s"
          +         }
                  }
                }
              }
            }
        EOT
      ~ modify_index            = "1614" -> (known after apply)
        name                    = "app"
      ~ region                  = "global" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # nomad_job.website will be created
  + resource "nomad_job" "website" {
      + allocation_ids          = (known after apply)
      + datacenters             = [
          + "dc1",
        ]
      + deployment_id           = (known after apply)
      + deployment_status       = (known after apply)
      + deregister_on_destroy   = true
      + deregister_on_id_change = true
      + detach                  = true
      + id                      = (known after apply)
      + jobspec                 = <<-EOT
            job "website" {
              datacenters = ["dc1"]
              type        = "service"
            
              update {
                max_parallel      = 1
                min_healthy_time  = "10s"
                healthy_deadline  = "3m"
                progress_deadline = "10m"
                auto_revert       = true
                canary            = 0
              }
            
              group "website" {
                count = 3
            
                network {
                  port "http" {
                    to = 3000
                  }
                }
            
                restart {
                  attempts = 2
                  interval = "30m"
                  delay    = "15s"
                  mode     = "fail"
                }
            
                task "website" {
                  driver = "docker"
            
                  config {
                    image = "perfolio/web-website"
                    ports = ["http"]
                  }
            
                  service {
                    name = "website"
                    port = "http"
            
                    tags = [
                      "traefik.enable=true",
                      "traefik.http.routers.website.rule=Host(`perfol.io`)",
                    ]
            
                  }
                }
              }
            }
        EOT
      + modify_index            = (known after apply)
      + name                    = "website"
      + namespace               = "default"
      + region                  = (known after apply)
      + task_groups             = [
          + {
              + count   = 3
              + meta    = (known after apply)
              + name    = "website"
              + task    = [
                  + {
                      + driver        = "docker"
                      + meta          = (known after apply)
                      + name          = "website"
                      + volume_mounts = null
                    },
                ]
              + volumes = null
            },
        ]
      + type                    = "service"
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>

*Pusher: @chronark, Action: `pull_request`, Working Directory: ``, Workflow: `Testing`*